Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/migrant_workers/employment_permits/reactivation_employment_permit.html.txt.tmx
Source language: en
Languages: ga

source: In general, non-EEA nationals must have an employment permit to work in Ireland
ga: Go ginearálta, caithfidh náisiúnaigh neamh-LEE cead fostaíochta a bheith acu chun oibriú in Éirinn

source: The Reactivation Employment Permit is for non-EEA nationals who came to Ireland on a valid employment permit, but who fell out of the system through no fault of their own or because of exploitation in the workplace
ga: Ceadaíonn an Cead Fostaíochta Athghníomhachtaithe do náisiúnaigh neamh-LEE a tháinig go hÉirinn ar chead bailí fostaíochta, ach a d’fhág an córas gan iad féin a bheith mar chúis leis nó mar gheall ar dhúthshaothrú san ionad oibre

source: The Reactivation Employment Permit enables them to work legally again
ga: Cuireann an Cead Fostaíochta Athghníomhachtaithe ar a gcumas oibriú go dleathach arís

source: The main features of the Reactivation Employment Permit are:
ga: Is iad príomhghnéithe an Cheada Fostaíochta Athghníomhachtaithe:

source: • You must previously have held an employment permit
ga: • Níor mhór go raibh cead fostaíochta agat roimhe seo

source: • You must not be currently employed
ga: • Ní mór nach bhfuil tú fostaithe faoi láthair

source: • You must have a job offer
ga: • Ní mór go bhfuil tairiscint poist agat

source: • You must have a temporary Stamp 1 immigration permission and have a “Reactivation Employment Permit” letter from the Department of Justice and Equality – see ‘How to apply’ below
ga: • Ní mór go bhfuil cead sealadach inimirce Stampa 1 agat mar aon le litir “Chead Fostaíochta Athghníomhachtaithe” ón Roinn Dlí agus Cirt agus Comhionannais – féach ‘Conas iarratas a dhéanamh’ thíos

source: • A labour market needs test is not required
ga: • Ní theastaíonn tástáil riachtanais mhargadh saothair

source: • It is available for all occupations, including certain carers but excluding all occupations in a domestic setting, for example, housekeepers
ga: • Tá an cead ar fáil do gach gairm, lena n-áirítear cúramóirí áirithe ach ní áirítear gach gairm i suíomh baile, mar shampla, coimeádaithe tí

source: The following non-EEA nationals can apply for a Reactivation Employment Permit:
ga: Féadfaidh na náisiúnaigh neamh-LEE a leanas iarratas a dhéanamh ar Chead Fostaíochta Athghníomhachtaithe:

source: • People who previously worked legally with an employment permit and are currently illegally resident
ga: • Daoine a bhíodh ag oibriú go dleathach le cead fostaíochta agus a bhfuil cónaí neamhdhleathach orthu faoi láthair

source: • People who hold a work permit for low-skilled and low-paid jobs who wish to change employer but do not qualify for the new General Employment Permit
ga: • Daoine a bhfuil cead oibre acu do phoist ar bheagán oiliúna agus ísealphá ar mian leo a bhfostóir a athrú ach nach gcáilíonn don Chead nua Fostaíochta Ginearálta

source: • Certain spousal/dependant permit holders who wish to apply for a new employment permit with a new employer but who do not qualify for the new Dependant/Partner/Spouse Employment Permit
ga: • Sealbhóirí áirithe ceada céile/cleithiúnaí ar mian leo iarratas a dhéanamh ar chead nua fostaíochta le fostóir nua ach nach gcáilíonn don Chead nua Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: • People who hold a spousal/dependant permit or the new Dependant/Partner/Spouse Employment Permit whose circumstances have changed, for example, separation and where the Minister for Justice and Equality is satisfied that a Reactivation Employment Permit should be considered in the case
ga: • Daoine a bhfuil cead céile/cleithiúnaí nó an Cead nua Fostaíochta Cleithiúnaí/Páirtnéara/Céile ar athraigh a gcúinsí, mar shampla, idirscaradh agus nuair atá an tAire Dlí agus Cirt agus Comhionannais sásta gur cheart breithniú a dhéanamh ar Chead Fostaíochta Athghníomhachtaithe sa chás

source: Who is not eligible
ga: Cé nach bhfuil i dteideal an cead a fháil?

source: Non-EEA nationals are not eligible for a Reactivation Employment Permit if:
ga: Níl náisiúnaigh neamh-LEE i dteideal Cead Fostaíochta Athghníomhachtaithe a fháil:

source: • They entered the State as students and visitors and have never held an employment permit
ga: • Má d’iontráil siad an Stát mar mhic léinn agus cuairteoirí agus mura raibh cead fostaíochta riamh acu

source: • They have already been granted a Reactivation Employment Permit
ga: • Má deonaíodh Cead Fostaíochta Athghníomhachtaithe cheana féin dóibh

source: • They hold Critical Skills, Green Card, work or General Employment Permits and have been made redundant
ga: • Má tá Scileanna Criticiúla, Cárta Glas, Ceadanna Fostaíochta Ginearálta nó oibre acu agus má rinneadh iomarcach iad

source: • They hold Intra-Company Transfer, Contract for Services, Internship or Exchange Agreement Employment Permits and have remained in the State after their permits have expired
ga: • Má tá Ceadanna Fostaíochta Aistrithe Ionchuideachta, Conradh le haghaidh Seirbhísí, Intéirnéireachta nó Comhaontú Malartaithe acu agus má d’fhan siad sa Stát i ndiaidh gur éag a gceadanna

source: • They previously had an employment permit and stamp 1 immigration permission but changed their status to another stamp
ga: • Bhí cead fostaíochta agus cead inimirce stampa 1 acu roimhe seo ach d’athraigh siad a stádas chuig stampa eile

source: You can read more about the eligibility criteria (pdf) for the Reactivation Employment Permit
ga: Féadfaidh tú breis faisnéise a léamh faoi na critéir cháilitheachta (pdf) don Chead Fostaíochta Athghníomhachtaithe

source: You must have a genuine job offer and you must have the qualifications, skills and experience required for the job
ga: Ní mór go bhfuil fíor-thairiscint poist agat agus ní mór go bhfuil na cáilíochtaí, scileanna agus taithí agat a theastaíonn don phost

source: You must be directly employed and paid by your employer
ga: Ní mór go mbíonn tú fostaithe agus íoctha go díreach ag d’fhostóir

source: The employer must be trading in Ireland, registered with Revenue and, if applicable, with the Companies Registration Office
ga: Ní mór go mbeidh an fostóir ag trádáil in Éirinn, cláraithe leis na Coimisinéirí Ioncaim agus, más infheidhme, leis an Oifig um Chlárú Cuideachtaí

source: Your employer cannot deduct recruitment expenses from your pay or retain your personal documents
ga: Ní féidir le d’fhostóir costais earcaíochta a bhaint ó do phá nó do cháipéisí pearsanta a choimeád

source: You must be paid at least the National Minimum Wage hourly rate
ga: Ní mór ráta in aghaidh na huaire an Íosphá Náisiúnta a íoc leat

source: A Reactivation Employment Permit will not be issued to companies where the granting of the permit would mean that more than 50% of the employees would be non-EEA nationals
ga: Ní eiseofar Cead Fostaíochta Ginearálta do chuideachtaí dá mbeadh breis agus 50% de na fostaithe ina náisiúnaigh neamh-LEE mar gheall ar an gcead a dheonú

source: However, this requirement may be waived where you will be the only employee
ga: Féadtar an ceanglas seo a tharscaoileadh, áfach, sa chás gur tusa a bheidh mar an t-aon fhostaí

source: This will also apply when you renew your permit
ga: Is amhlaidh a bheidh i gceist nuair a dhéanann tú do chead a athnuachan, chomh maith

source: A Reactivation Employment Permit is issued first for 2 years and then may be renewed for a further 3 years
ga: Eisítear Cead Fostaíochta Athghníomhachtaithe i dtosach ar feadh 2 bhliain agus féadtar é a athnuachan ar feadh 3 bliana ina dhiaidh sin

source: If you have worked for 5 consecutive years on a work permit you may no longer need a permit to work in Ireland
ga: Má d’oibrigh tú ar feadh cúig bliana as a chéile ar chead fostaíochta, b’fhéidir nach dteastóidh cead uait a thuilleadh chun oibriú in Éirinn

source: When your stamp 1 permission is due for renewal your local immigration officer – see ‘Registration’ below – will issue you with a stamp 4 immigration permission for one year which will allow you to take up any employment but not self-employment
ga: Nuair atá do chead stampa 1 dlite le hathnuachan, eiseoidh d’oifigeach áitiúil inimirce – féach ‘Clárúchán’ thíos – cead inimirce stampa 4 ar feadh bliain amháin duit a cheadóidh duit glacadh le haon fhostaíocht, seachas féinfhostaíocht

source: When you have been legally living and working in Ireland for 5 years on a work permit you can apply for long-term residence to the Irish Naturalisation and Immigration Service (INIS) - see 'Where to apply' below
ga: Nuair a bhí tú ag oibriú agus i do chónaí go dleathach in Éirinn ar feadh 5 bliana ar chead oibre, féadfaidh tú iarratas a dhéanamh ar chónaitheacht fhadtéarmach le Seirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: You may also apply for exemption from the requirement to have an employment permit
ga: Chomh maith leis sin, féadfaidh tú iarratas a dhéanamh ar dhíolúine ón gceanglas chun cead fostaíochta a bheith agat

source: If your application is successful you will be granted extended residence permission for a further 5 years and you will not need a work permit to work in Ireland
ga: Má éiríonn le d’iarratas, deonófar cead sínte cónaitheachta duit do 5 bliana breise agus ní theastóidh cead oibre uait chun oibriú in Éirinn

source: If this is your first Reactivation Employment Permit, you are expected to stay with your new employer for 12 months (apart from in exceptional circumstances)
ga: Más é seo do chéad Chead Fostaíochta Athghníomhachtaithe, bítear ag súil leis go bhfanfaidh tú le d’fhostóir ar feadh 12 mhí (seachas faoi chúinsí eisceachtúla)

source: After that you may move to a new employer provided that a new application for an employment permit is made
ga: Ina dhiaidh sin, féadfaidh tú aistriú chuig fostóir nua, a fhad agus go ndéantar iarratas nua ar chead fostaíochta

source: If you are made redundant while you hold a Reactivation Employment Permit, you should notify the Department of Jobs, Enterprise and Innovation
ga: Má dhéantar iomarcach thú fad atá Cead Fostaíochta Athghníomhachtaithe agat, ba cheart duit fógra a thabhairt don Roinn Post, Fiontar agus Nuálaíochta

source: The Department will allow you 6 months to find another job
ga: Tabharfaidh an Roinn 6 mhí duit chun post eile a aimsiú

source: When you find another job you will be issued with a new Reactivation Employment Permit in accordance with the requirements of the scheme
ga: Nuair a aimsíonn tú post eile, eiseofar Cead Fostaíochta Athghníomhachtaithe nua duit i gcomhréir le ceanglais na scéime

source: If you have not found a new job after 6 months you should contact your local immigration officer to confirm your immigration status
ga: Murar aimsigh tú post nua i ndiaidh 6 mhí, ba cheart duit teagmháil a dhéanamh le d’oifigeach áitiúil inimirce le do stádas inimirce a dheimhniú

source: If you decide to leave the country and you then get an offer of employment in Ireland you may apply for a new employment permit
ga: Má dhéanann tú an cinneadh chun an tír a fhágáil agus má fhaigheann tú tairiscint poist in Éirinn, féadfaidh tú iarratas a dhéanamh ar chead fostaíochta nua

source: If you have a Reactivation Employment Permit, your spouse, partner or dependants are not eligible for a Dependant/Partner/Spouse Employment Permit
ga: Má tá Cead Fostaíochta Athghníomhachtaithe agat, níl do chéile, páirtnéir nó cleithiúnaithe i dteideal iarratas a dhéanamh ar Chead Fostaíochta Cleithiúnaí/Páirtnéara/Céile

source: They can apply for a General Employment Permit in their own right
ga: Féadfaidh siad iarratas a dhéanamh ar Chead Fostaíochta Ginearálta as a stuaim féin

source: The fees for Reactivation Employment Permits are as follows:
ga: Seo a leanas na táillí a ghearrtar ar Cheada Fostaíochta Athghníomhachtaithe:

source: │Duration of permit │Amount │
ga: │Fad an cheada │Méid │

source: │Up to 6 months │€500 │
ga: │A fhad le 6 mhí │€500 │

source: │Up to 2 years │€1,000 │
ga: │A fhad le 2 bhliain │€1,000 │

source: │Up to 6 months │€750 │
ga: │A fhad le 6 mhí │€750 │

source: │Up to 3 years │€1,000 │
ga: │A fhad le 3 bhliain │€1,000 │

source: If an application is refused, 90% of the fee will be refunded to the applicant
ga: Má dhiúltaítear iarratas, aisíocfar 90% den táille leis an iarratasóir

source: The fee for the GNIB Certificate of Registration is €300
ga: Is í an táille atá ar Dheimhniú Clárúcháin BNIGS ná €300

source: Applying for a Temporary Stamp 1
ga: Iarratas a dhéanamh ar Stampa 1 Sealadach

source: You must first get a temporary Stamp 1 immigration permission
ga: Ní mór duit cead inimirce sealadach Stampa 1 a fháil i dtosach báire

source: When you have a current job offer, you apply to the Irish Naturalisation and Immigration Service (INIS) for a Reactivation Employment Permit Permission using the application form (pdf) and guidelines (pdf)
ga: Nuair a bhíonn tairiscint poist reatha agat, déanann tú iarratas ar Sheirbhís Eadóirseachta agus Inimirce na hÉireann (SEIÉ) ar Chead Fostaíochta Athghníomhachtaithe agus an fhoirm iarratais (pdf) agus na treoirlínte (pdf) a úsáid

source: You send the completed application to Unit 2 Residence Division of INIS – see ‘Where to apply’ below
ga: Seolann tú an t-iarratas comhlánaithe chuig Aonad 2, Rannóg Cónaitheachta an SEIÉ – féach ‘Cá ndéanfaidh mé iarratas? ’ thíos

source: Your application is assessed and if you qualify, you are given a stamp 1 permission for 4 months
ga: Measúnaítear d’iarratas agus má cháilíonn tú, tugtar cead stampa 1 duit ar feadh 4 mhí

source: You must register this permission with the GNIB – see ‘Registration’ below
ga: Ní mór duit an cead seo a chlárú leis an BNIGS – féach ‘Clárúchán’ thíos

source: Applying for a Reactivation Employment Permit
ga: Iarratas a dhéanamh ar Chead Fostaíochta Athghníomhachtaithe

source: You (or your prospective employer) can make a new application for a Reactivation Employment Permit to the Employment Permits Section of the Department of Jobs, Enterprise and Innovation
ga: Féadfaidh tú (nó d’fhostóir ionchasach) iarratais nua a dhéanamh ar Chead Fostaíochta Athghníomhachtaithe leis an Rannóg Ceadanna Fostaíochta den Roinn Post, Fiontar agus Nuálaíochta

source: You apply using the Employment Permits Online System (EPOS)
ga: Ó 5 Meán Fómhair 2016, féadtar iarratais a dhéanamh ar líne agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: The supporting documentation required includes the “Reactivation Employment Permit” letter from the Department of Justice and Equality
ga: Áirítear an cháipéisíocht tacaíochta a theastaíonn an litir “Chead Fostaíochta Athghníomhachtaithe” ón Roinn Dlí agus Cirt agus Comhionannais

source: You can check the status of your application through the online status enquiry facility
ga: Féadfaidh tú stádas d’iarratas tríd an tsaoráid fhiosrúcháin faoi stádas ar líne a sheiceáil

source: The application processing times are on the Department of Jobs, Enterprise and Innovation’s website
ga: Tá na hamanna próiseála iarratais ar shuíomh gréasáin na Roinne Post, Fiontar agus Nuálaíochta

source: The official processing your application will either grant it or refuse it and must give specific reasons for refusal
ga: Déanfaidh próiseáil oifigiúil d’iarratais é a dheonú nó a dhiúltú agus ní mór údair shonracha a thabhairt má dhiúltaítear é

source: If your application is refused you may appeal the decision within 28 days, using the review of decision to refuse an employment permit form
ga: Má dhiúltaítear d’iarratas, féadfaidh tú achomharc a dhéanamh ar an gcinneadh laistigh de 28 lá, trí leas a bhaint as an bhfoirm um athbhreithniú ar chinneadh chun cead fostaíochta a dhiúltú

source: Either an employer or an employee can apply for a renewal using the Employment Permits Online System (EPOS) 16 weeks before the expiry of the permit
ga: Féadfaidh fostóir nó an fostaí iarratas a dhéanamh ar athnuachan agus leas á bhaint as an gCóras Ceadanna Fostaíochta Ar Líne (CCFA)

source: When you are issued with your Reactivation Employment Permit you need to register with the Burgh Quay Registration Office (if living in Dublin) or the regional registration office or the local Garda District Headquarters (if living outside Dublin)
ga: Nuair a eisítear do Chead Fostaíochta Athghníomhachtaithe duit, is gá duit clárú le hOifig Chlárúcháin Cé an Bhúrcaigh (má tá cónaí ort i mBaile Átha Cliath) nó ag oifig chlárúcháin régiúnach nó ag Ceanncheathrú áitiúil an Gharda Síochána (má tá cónaí ort lasmuigh de Bhaile Átha Cliath)

source: You must do this to get permission to remain in the State as an employee
ga: Is tábhachtach seo a dhéanamh, mar mura ndéantar é, ní bheidh an stádas ceart inimirce agat

source: It is important to do this as otherwise you will not have the correct immigration status
ga: Ó 15 Meán Fómhair 2016, caithfidh tú coinne a scríobh isteach ar líne chun cuairt a thabhairt air

source: There is further information about Reactivation Employment Permits on the Department's website
ga: Lasmuigh de Bhaile Átha Cliath, féadfaidh tú clárú nó Ceanncheathrú áitiúil Cheantar an Gharda Síochána
